**Exploratory Data Analysis (EDA):**

#import the needed Librarie

In [1]:
import pandas as pd
import numpy as np
from sklearn.preprocessing import LabelEncoder

# Data Collection

In [3]:
# loading the dataset

data=pd.read_csv("Churn_for_bank_customers.csv")



# Exploratory Data Analysis

<div style="text-align: left; color: yellow;">

	

% CustomerId . 	

% Surname : surname of a customer 

% CreditScore:is a numerical measure of an individual's creditworthiness

% Geographya :customers location 

% Gender :Male or Female

% Age		

% Tenure: the number of years that the customer has been a client of the bank.

% Balance: balance in customer accounts 	

% NumOfProduct:the number of products that a customer has purchased through the Bank	

% HasCrCard : whether or not a customer has a credit card. 	

% IsActiveMember: indicate whether customer is Active ornot

% EstimatedSalary: estiamted customer Salary

% Exited : whether or not the customer left the bank.	

</div>

In [5]:
# printing the first five rows of the dataframe
data.head()

,Row Nu,Customer Id,Surname,Credit score,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

In [6]:

data.sample(10)

,Row Nu,Customer Id,Surname,Credit score,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
3987,3988,15726484,Pollard,633,France,Male,37,7,141546.35,1,1,1,124830.11,0
5182,5183,15613102,Ogochukwu,670,France,Female,31,2,57530.06,1,1,1,181893.31,1
7173,7174,15636521,Feng,744,Spain,Female,30,1,124037.28,1,1,1,142210.94,0
2281,2282,15778320,Teng,848,Germany,Female,40,5,148495.64,1,0,0,158853.98,0
4540,4541,15613017,McMillan,586,Germany,Male,32,1,149814.54,1,1,0,31830.06,0
9269,9270,15705383,Shen,642,France,Male,35,4,125476.31,1,1,1,91775.51,0
9113,9114,15760662,Francis,521,Germany,Female,29,2,87212.80,1,1,1,994.86,0
8626,8627,15672447,Bailey,657,Germany,Male,40,7,99165.84,1,0,1,119333.95,1
5315,5316,15572956,Steen,683,France,Male,36,5,115350.63,1,1,1,122305.91,0
4996,4997,15620341,Nwebube,500,Germany,Male,44,9,160838.13,2,1,0,196261.64,0

In [10]:
# explore columns
data.columns

Index(['Row Nu', 'Customer Id', 'Surname', 'Credit score', 'Geography',
       'Gender', 'Age', 'Tenure ', 'Balance', 'NumOfProducts', 'HasCrCard',
       'IsActiveMember', 'EstimatedSalary', 'Exited'],
      dtype='object')

In [11]:
#explore Data shape
data.shape

(10000, 14)

In [12]:
# checking the data types
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Row Nu           10000 non-null  int64
 1   Customer Id      10000 non-null  int64
 2   Surname          10000 non-null  object
 3   Credit score     10000 non-null  int64
 4   Geography        10000 non-null  object
 5   Gender           10000 non-null  object
 6   Age              10000 non-null  int64
 7   Tenure           10000 non-null  int64
 8   Balance          10000 non-null  float64
 9   NumOfProducts    10000 non-null  int64
 10  HasCrCard        10000 non-null  int64
 11  IsActiveMember   10000 non-null  int64
 12  EstimatedSalary  10000 non-null  float64
 13  Exited           10000 non-null  int64
dtypes: float64(2), int64(9), object(3)
memory usage: 1.1+ MB

<div style="text-align: left; color: yellow;">
###############################################################


RowNumber--> has no effect on the output. 

CustomerId--> has no effect on customer leaving the bank. 	

Surname--> has no impact on their decision to leave the bank.

</div>

In [13]:
# removing the Row Nu,Customer Id and Surname column
data.drop(columns=['Row Nu','Customer Id','Surname'], axis=1, inplace=True)

In [14]:
data.shape

(10000, 11)

In [15]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Credit score     10000 non-null  int64
 1   Geography        10000 non-null  object
 2   Gender           10000 non-null  object
 3   Age              10000 non-null  int64
 4   Tenure           10000 non-null  int64
 5   Balance          10000 non-null  float64
 6   NumOfProducts    10000 non-null  int64
 7   HasCrCard        10000 non-null  int64
 8   IsActiveMember   10000 non-null  int64
 9   EstimatedSalary  10000 non-null  float64
 10  Exited           10000 non-null  int64
dtypes: float64(2), int64(7), object(2)
memory usage: 859.5+ KB

# Check the Null values

In [17]:
data.isnull().sum()

Credit score       0
Geography          0
Gender             0
Age                0
Tenure             0
Balance            0
NumOfProducts      0
HasCrCard          0
IsActiveMember     0
EstimatedSalary    0
Exited             0
dtype: int64

<div style="text-align: left; color: yellow;">
~~ As we can see, the dataset has no missing values
</div>




# Statistical summary of the data

In [18]:
data.describe().T

,count,mean,std,min,25%,50%,75%,max
Credit score,10000.0,650.528800,96.653299,350.00,584.00,652.000,718.0000,850.00
Age,10000.0,38.921800,10.487806,18.00,32.00,37.000,44.0000,92.00
Tenure,10000.0,5.012800,2.892174,0.00,3.00,5.000,7.0000,10.00
Balance,10000.0,76485.889288,62397.405202,0.00,0.00,97198.540,127644.2400,250898.09
NumOfProducts,10000.0,1.530200,0.581654,1.00,1.00,1.000,2.0000,4.00
HasCrCard,10000.0,0.705500,0.455840,0.00,0.00,1.000,1.0000,1.00
IsActiveMember,10000.0,0.515100,0.499797,0.00,0.00,1.000,1.0000,1.00
EstimatedSalary,10000.0,100090.239881,57510.492818,11.58,51002.11,100193.915,149388.2475,199992.48
Exited,10000.0,0.203700,0.402769,0.00,0.00,0.000,0.0000,1.00

<div style="text-align: left; color: yellow;">
~~ mean & median (50th Percentile) are close to each other for creditscore,Age,Tenure and EstimatedSalary
</div>

Checking the distribution of target Variable.

In [20]:
data["Exited"].value_counts()

Exited
0    7963
1    2037
Name: count, dtype: int64

<div style="text-align: left; color: yellow;">
~~There is an imbalance in the data.
</div>

Checking the non-numiric columns

In [23]:
data["Gender"].value_counts()

Gender
Male      5457
Female    4543
Name: count, dtype: int64

Label Encoding for Gender

In [24]:
# encoding the target column
G_encode = LabelEncoder()

labels = G_encode.fit_transform(data['Gender'])

data['gender'] = labels

data.drop(columns='Gender', axis=1, inplace=True)

In [26]:
data["gender"].value_counts()

gender
1    5457
0    4543
Name: count, dtype: int64

In [22]:
data["Geography"].value_counts()

Geography
France     5014
Germany    2509
Spain      2477
Name: count, dtype: int64

encoding Geography because of the three values

In [31]:
Geo_labeles=pd.get_dummies(data["Geography"],prefix="Geography").astype(float)
Geo_labeles

      Geography_France  Geography_Germany  Geography_Spain
0                  1.0                0.0              0.0
1                  0.0                0.0              1.0
2                  1.0                0.0              0.0
3                  1.0                0.0              0.0
4                  0.0                0.0              1.0
...                ...                ...              ...
9995               1.0                0.0              0.0
9996               1.0                0.0              0.0
9997               1.0                0.0              0.0
9998               0.0                1.0              0.0
9999               1.0                0.0              0.0

[10000 rows x 3 columns]

In [33]:
data = pd.concat([data, Geo_labeles], axis=1)
data = data.drop(columns=["Geography"])

In [34]:
data.sample(10)

,Credit score,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,gender,Geography_France,Geography_Germany,Geography_Spain
2362,709,45,4,122917.71,1,1,1,11.58,1,1,0.0,1.0,0.0
3965,748,23,8,85600.08,1,0,0,134077.71,0,0,0.0,0.0,1.0
5389,774,32,4,0.00,2,0,0,114899.13,0,0,1.0,0.0,0.0
7791,584,31,6,152622.34,1,1,0,99298.80,0,0,0.0,1.0,0.0
2695,597,39,8,162532.14,3,1,0,36051.46,1,0,0.0,1.0,0.0
2999,525,33,1,112833.35,1,0,1,175178.56,0,1,1.0,0.0,0.0
9589,632,71,3,83116.68,1,1,1,27597.76,0,1,1.0,0.0,0.0
1372,489,38,8,0.00,2,0,1,196990.79,0,1,1.0,0.0,0.0
7767,561,49,1,102025.32,1,1,0,133051.64,1,0,0.0,1.0,0.0
7266,762,60,10,168920.75,1,1,0,31445.03,1,0,0.0,0.0,1.0

In [ ]:
data.describe().T

,count,mean,std,min,25%,50%,75%,max
Credit score,10000.0,650.528800,96.653299,350.00,584.00,652.000,718.0000,850.00
Age,10000.0,38.921800,10.487806,18.00,32.00,37.000,44.0000,92.00
Tenure,10000.0,5.012800,2.892174,0.00,3.00,5.000,7.0000,10.00
Balance,10000.0,76485.889288,62397.405202,0.00,0.00,97198.540,127644.2400,250898.09
NumOfProducts,10000.0,1.530200,0.581654,1.00,1.00,1.000,2.0000,4.00
HasCrCard,10000.0,0.705500,0.455840,0.00,0.00,1.000,1.0000,1.00
IsActiveMember,10000.0,0.515100,0.499797,0.00,0.00,1.000,1.0000,1.00
EstimatedSalary,10000.0,100090.239881,57510.492818,11.58,51002.11,100193.915,149388.2475,199992.48
Exited,10000.0,0.203700,0.402769,0.00,0.00,0.000,0.0000,1.00
gender,10000.0,0.545700,0.497932,0.00,0.00,1.000,1.0000,1.00
Geography_France,10000.0,0.501400,0.500023,0.00,0.00,1.000,1.0000,1.00
Geography_Germany,10000.0,0.250900,0.433553,0.00,0.00,0.000,1.0000,1.00
Geography_Spain,10000.0,0.247700,0.431698,0.00,0.00,0.000,0.0000,1.00

In [40]:
data.groupby("Exited").mean()

,Credit score,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,gender,Geography_France,Geography_Germany,Geography_Spain
Exited,,,,,,,,,,,,
0,651.853196,37.408389,5.033279,72745.296779,1.544267,0.707146,0.554565,99738.391772,0.572523,0.527942,0.212859,0.259199
1,645.351497,44.837997,4.932744,91108.539337,1.475209,0.699067,0.360825,101465.677531,0.440844,0.397644,0.399607,0.202749

<div style="text-align: left; color: yellow;">
~~mean for some features are clearly different 

</div>

**Summary from EDA:**
<div style="text-align: left; color: yellow;">

1. No missing Values

2. All data set columns now are  a numerical values .

3. the mean and the median are nearly for most of the features .

4. Imbalance in the dataset (Exited(1) customers are less than not exited(0) customers)

5. Mean of some features are clearly different  for the grouped goal class (Exited)
</div>